Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Comment>(Общ) Классификатор банков</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>(Регл) Корреспонденский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНН</Name>
					<Comment>Регистрационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВПлатежнойСистеме</Name>
					<Comment>Код банка в платежной системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Comment>(Регл) процент комиссионного вознаграждения банку</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Comment>используется с 07.06.2010</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКДоРеформыБанковскихСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВПлатежнойСистемеДоРеформыБанковскихСчетов</Name>
					<Comment>Код банка в платежной системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Банки/Forms/УправляемаяФормаВыбора/Ext/Form/Module.bsl
// Процедура - обработчик нажатия кнопки "ОбновлениеБИКов"
// подменю "Действия"
//
&НаКлиенте
Процедура ДействияФормыОбновлениеБИКов(Кнопка)
	Сообщить("Обработка справочника ""Банки"". Заполнение реквизитов ""БИК"" .");

	ДействияФормыОбновлениеБИКовНаСервере();
	
	Сообщить("Обработка справочника ""Банки"". Заполнение реквизитов ""БИК"" закончена.");

КонецПроцедуры

&НаСервере
Процедура ДействияФормыОбновлениеБИКовНаСервере()
	ТзБанков = ЗагрузитьКлассификаторБанков();
	// обработка справочника "Банки"
	ТзБанков = ЗагрузитьКлассификаторБанков();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Банки.Ссылка,
	               |	Банки.Код,
	               |	Банки.КодВПлатежнойСистеме,
	               |	Банки.БИК,
	               |	Банки.БИКДоРеформыБанковскихСчетов,
	               |	Банки.КодВПлатежнойСистемеДоРеформыБанковскихСчетов,
	               |	Банки.Представление
	               |ИЗ
	               |	Справочник.Банки КАК Банки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.БИК) тогда
			Продолжить;
		КонецЕсли;
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если СпрОбъект.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		// попытка поиска по старому БИК
		Стр = ТзБанков.Найти(СокрЛП(Выборка.БИКДоРеформыБанковскихСчетов), "СтарыйБИК"); 
		Если Стр = Неопределено Тогда
			Попытка
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.Записать();
			Исключение
				Сообщить(" при записи элемента " + Выборка.Представление + " произошла ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
			Продолжить;
		КонецЕсли;		
		СпрОбъект.БИК = Стр.БИК;
		СпрОбъект.КодВПлатежнойСистеме = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Стр.БИК);
		Попытка
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		Исключение
			Сообщить(" при записи элемента " + Выборка.Представление + " произошла ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
	КонецЦикла;
	
	
	
КонецПроцедуры

// процедура заполнения таблицы значений
// для обработки новых банковских кодов
&НаСервере
Функция ЗагрузитьКлассификаторБанков()
	Макет 	= Справочники.Банки.ПолучитьМакет("ОбщаяТаблицаСоответствияБанковскихРеквизитов");
	Область = Макет.Области["КлассификаторБанков"];
	ТзБанков = Новый ТаблицаЗначений;
	ТзБанков.Колонки.Добавить("БИК");
	ТзБанков.Колонки.Добавить("СтарыйБИК");
	ТзБанков.Колонки.Добавить("Наименование");
	Для Ном = Область.Верх По Область.Низ Цикл
		НоваяСтрока = ТзБанков.Добавить();
		НоваяСтрока.БИК = СокрЛП(Макет.Область(Ном, 1).Текст);
		НоваяСтрока.СтарыйБИК = СокрЛП(Макет.Область(Ном, 2).Текст);
		НоваяСтрока.Наименование = СокрЛП(Макет.Область(Ном, 3).Текст);
	КонецЦикла;
	Возврат ТзБанков;
КонецФункции
